index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-25 Thu 14:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Analysis of Loanable Funds</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">An Analysis of Loanable Funds</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf027993">1. Supply of Loanable Funds</a>
<ul>
<li><a href="#org20fcf17">1.1. Households</a></li>
<li><a href="#orgb4de154">1.2. Businesses</a></li>
<li><a href="#orgc0eb188">1.3. Governments</a></li>
<li><a href="#org3b21f95">1.4. The Federal Reserve</a></li>
</ul>
</li>
<li><a href="#org0ad6840">2. Demand of Loanable Funds</a>
<ul>
<li><a href="#orgc3aae19">2.1. Household Demand</a></li>
<li><a href="#org5eab63b">2.2. Business Demand</a></li>
<li><a href="#org0cf4798">2.3. Government Demand</a></li>
</ul>
</li>
<li><a href="#org7038ad8">3. Macroeconomic Factors that Shift the Equilibrium Interest Rate</a>
<ul>
<li><a href="#orgcbae25f">3.1. Economic Growth</a>
<ul>
<li><a href="#orge80796a">3.1.1. An Increase in Economic Growth</a></li>
<li><a href="#org4b41ff5">3.1.2. An Decrease in Economic Growth</a></li>
</ul>
</li>
<li><a href="#orgc819e78">3.2. Inflation</a>
<ul>
<li><a href="#org2bc0544">3.2.1. Increase in Inflation</a></li>
<li><a href="#org12281a4">3.2.2. Increase in US Debt</a></li>
<li><a href="#org5fa905c">3.2.3. Foreign Flows</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfb2761f">4. Conclusion</a></li>
</ul>
</div>
</div>
<head>
    <script type="text/javascript" src="https://www.gstatic.com/charts/loader.js"></script>
    <script type="text/javascript">
      google.charts.load('current', {'packages':['corechart']});

      
      google.charts.setOnLoadCallback(drawChart);

      google.charts.setOnLoadCallback(drawChart2);
      google.charts.setOnLoadCallback(drawChart3);
      google.charts.setOnLoadCallback(drawChart4);
      google.charts.setOnLoadCallback(drawChartVert);


// supply loanable funds
      
      function drawChart3() {
        var data = google.visualization.arrayToDataTable([
          ['Quantity', 'Supply'],
          ['500',       2],
          ['600',       3],
          ['700',       4],
          ['800',       5]
        ]);

        var options = {
          title: '%',
          curveType: 'function',
          legend: { position: 'bottom' },
	    colors: ['#ff0000'],
        };

        var chart = new google.visualization.LineChart(document.getElementById('curve_chart3'));

        chart.draw(data, options);
      }

// demand loanable funds
      
      function drawChart4() {
        var data = google.visualization.arrayToDataTable([
          ['Quantity', 'Demand'],
          ['500',      5],
          ['600',      4],
          ['700',      3],
          ['800',      2]
        ]);

        var options = {
          title: '%',
          curveType: 'function',
          legend: { position: 'bottom' },
	    colors: ['#0000FF'],
        };

        var chart = new google.visualization.LineChart(document.getElementById('curve_chart4'));

        chart.draw(data, options);
      }

      // govt demand loanable funds verticle
      
      function drawChartVert() {
        var data = google.visualization.arrayToDataTable([
          ['Quantity', 'Demand'],
          ['600',      5],
          ['600',      4],
          ['600',      3],
          ['600',      2]
        ]);

        var options = {
          title: '%',
          curveType: 'function',
          legend: { position: 'bottom' },
	    colors: ['#0000FF'],
        };

        var chart = new google.visualization.LineChart(document.getElementById('curve_chart_vert'));

        chart.draw(data, options);
      }


// increase econ growth
      
      function drawChart() {
        var data = google.visualization.arrayToDataTable([
          ['Quantity', 'Old Demand', 'New Demand', 'Supply'],
          ['500',  5, 6,     2],
          ['600',  4, 5,     3],
          ['700',  3, 4,     4],
          ['800',  2, 3,     5]
        ]);

        var options = {
          title: '%',
          curveType: 'function',
          legend: { position: 'bottom' },
	  series: {
            1: { lineDashStyle: [1, 1] },
	    },
	    colors: ['#0000FF', '#0000FF', '#ff0000'],
        };

        var chart = new google.visualization.LineChart(document.getElementById('curve_chart'));

        chart.draw(data, options);
      }


// infltion increase

            function drawChart2() {
        var data = google.visualization.arrayToDataTable([
          ['Quantity', 'Old Demand', 'New Demand', 'Old Supply', 'New Supply'],
          ['500',  5,  6,    2, 3],
          ['600',  4,  5,    3, 4],
          ['700',  3,  4,    4, 5],
          ['800',  2,  3,    5, 6]
        ]);

        var options = {
          title: '%',
          curveType: 'function',
          legend: { position: 'bottom' },
	  series: {
            1: { lineDashStyle: [1, 1] },
            3: { lineDashStyle: [1, 1] },
	    },
	    colors: ['#0000FF', '#0000FF', '#ff0000', '#ff0000'],
        };

        var chart = new google.visualization.LineChart(document.getElementById('curve_chart2'));

        chart.draw(data, options);
      }

    </script>
  </head>



<p>
In these notes we'll discuss the factors affecting the supply and demand for loanable funds.  Understanding these factors will give you a framework within which you can understand changes in equilibrium interest rates.
</p>

<p>
Before we jump in, however, you may want to take a look at the following video to understand what we mean by <i>equilibrium</i> and in what sense it may be used.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/FveAr7T9fY0?si=kmkn_FOXU1PsFS-k" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>


<div id="outline-container-orgf027993" class="outline-2">
<h2 id="orgf027993"><span class="section-number-2">1.</span> Supply of Loanable Funds</h2>
<div class="outline-text-2" id="text-1">
<p>
Loanable funds are supplied primarily by (1) households, and also by (2) government and (3) businesses.  Note, funds are not supplied by banks&#x2014;banks are merely the <i>intermediaries</i>.
</p>

<div id="curve_chart3"></div>

<p>
The supply curve for loanable funds is increasing.  This means as interest rates increase (the price of these funds), more funds are offered for loans.  This is analogous to more copper (or any asset) being offered for sale if the copper price is higher.
</p>
</div>

<div id="outline-container-org20fcf17" class="outline-3">
<h3 id="org20fcf17"><span class="section-number-3">1.1.</span> Households</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Households supply loanable funds through bank deposits and CD purchases.  Also, foreign households can supply loanable funds in the US market by purchasing securities (including US Treasury securities).  Households are a net supplier of funds.
</p>
</div>
</div>

<div id="outline-container-orgb4de154" class="outline-3">
<h3 id="orgb4de154"><span class="section-number-3">1.2.</span> Businesses</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Businesses may supply funds, however they are net demanders of funds.
</p>
</div>
</div>

<div id="outline-container-orgc0eb188" class="outline-3">
<h3 id="orgc0eb188"><span class="section-number-3">1.3.</span> Governments</h3>
<div class="outline-text-3" id="text-1-3">
<p>
While certain part of the US government may supply funds, the US government is a net demander of funds due to its fiscal policy of spending much more than the tax revenues it collects. 
</p>
</div>
</div>

<div id="outline-container-org3b21f95" class="outline-3">
<h3 id="org3b21f95"><span class="section-number-3">1.4.</span> The Federal Reserve</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We will dedicate an entire set of lecture notes to the Fed later, however here we will note the Fed has a massive effect on the supply of loanable funds.  The Fed can create money through asset purchases, and therefore can at any point provide as much loanable funds to US markets as they wish.  Note, the Fed is not part of the US government.
</p>
</div>
</div>
</div>

<div id="outline-container-org0ad6840" class="outline-2">
<h2 id="org0ad6840"><span class="section-number-2">2.</span> Demand of Loanable Funds</h2>
<div class="outline-text-2" id="text-2">
<p>
The demand curve is downwards sloping because less funds are demanded when the price of these funds (the interest rate) is higher.
</p>

<div id="curve_chart4"></div>
</div>
