index.org
** Household Demand

Households demand funds for houses (mortgages), auto loans, and general spending (revolving loans). Generally thier demand for loanable funds increases over time with inflation and increasing wages.

** Business Demand

Businesses use decision rules such as Net Present Value and Internal Rate of Return to decide whether to make a capital investment. These rules are more likely to accept a project if the interest rate is lower, and therefore businesses demand more funds at lower interest rates.

Taxes may also have a large effect on business demand for loanable funds.  If corporate taxes decline then cash flows increase and business demand for funds will shift right.  /Shift right/ means more funds are demanded at every interest rate.

** Government Demand

Government demand for loanable funds is unique in that it generally doesn't depend on the interest rate. Governments demand the same amount of funds regardless of the interest rate.  We can represent this with a vertical demand curve. 


#+begin_comment
#+begin_export html
<div id="curve_chart_vert"></div>
#+end_export
#+end_comment

* Macroeconomic Factors that Shift the Equilibrium Interest Rate

In this section we will take a look at how the supply and demand for loanable funds will react to changes in macroeconomic variables. This will tell us the effect on the equilibrium interest rate.

** Economic Growth

*** An Increase in Economic Growth

An increase in economic growth will increase the demand for loanable funds---funds are needed for capital expansion.  The supply of loanable funds will generally remain unchanged.  This means interest rates will increase with increasing economic growth.

#+begin_export html
<div id="curve_chart"></div>
#+end_export

*** An Decrease in Economic Growth

Conversely, a decrease in economic growth will decrease the demand for loanable funds and leave the supply unchanged, thereby lowering interest rates.

#+begin_quote
**Passive Monetary Policy**: Note the Federal Reserve lowers interest rates when economic growth slows and raises interest rates when economic growth increases such that it causes inflation. But from what we just learned, we don't need the Fed to do this---interest rates will adjust by themselves.  The Fed will counter that they will increase and decrease interest rates /before/ the economic slowdown (or inflation) thereby keeping economic growth constant.  However a problem with this assertion (besides the Fed's track record) is you would need to be able to forecast economic growth which is a very difficult task.  
#+end_quote

** Inflation 

We may already be somewhat familiar with the relationship between inflation and nominal interest rates from the Fisher Effect:

$$(1 + n) = (1 + r)(1 + i)$$

where:

- n: the nominal interest rate
- r: the real interest rate
- i: expected inflation

#+begin_quote
-  Nominal Interest Rate:  the change in the amount of dollars you will have.
-  Real Interest Rate:  the change in the amount of stuff you will be able to buy
Note: we care about the real rate.
#+end_quote

From this equation we can see that as inflation increases, the nominal interest rate increases.  Nominal interest rates and inflation are positively related.

*** Increase in Inflation

Supply decreases and demand increases causing an increase in the equilibrium interest rate.

#+begin_export html
<div id="curve_chart2"></div>
#+end_export

See the video below for an explanation of the change in the equilibrium interest rate.

#+begin_export html
<iframe width="560" height="315" src="https://www.youtube.com/embed/JAe5dE619dA?si=XQb0Mb2TnVncpex8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
#+end_export

A decrease in inflation expectations will have the opposite effects on supply and demand, and thereby lower the equilibrium interest rate.

*** Increase in US Debt

The US government generally runs budget deficits and has a massive amount of outstanding debt.   This means as the government demands more funds, the demand curve shifts right, while the supply curve is unchanged.  This means the interest rate increases.

Remember the shape of the curve of the government demand for loanable funds---it is vertical meaning the government demands funds regardless of the interest rate. This means the government may demand so much funds that it increases interest rates beyond what businesses can pay.  This is called /crowding out/.

#+begin_quote
**A History of Crowding Out**:  Politicians like to spend, and so they have a history of downplaying the effect of government borrowing on interest rates.  For example, a recent Vice President was famous for stating "Deficits don't matter".
#+end_quote

From approximately 2000 to 2021 the US ran increasingly large deficits (as you can see in the charts below), however interest rates generally fell.  This is because while the US increased it debt, the Fed also increased the money supply (chart below).   The Fed essentially financed much of the US deficits with new money.  Foreigners also financed part of the deficits.  This works so long as inflation remains low, however inflation markedly increased around 2022, so the Fed may no longer be able to finance deficit spending.




#+caption: Total US Debt in $.  
#+begin_export html
<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1cSNC&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
#+end_export


#+caption: Total US Debt as a percent of US GDP. 
#+begin_export html
<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1dsBt&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
#+end_export

#+begin_export html
<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1aBRl&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
#+end_export

#+begin_export html
<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1ep1G&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
#+end_export


#+begin_export html
<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1epHK&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
#+end_export


