index.html

<div id="outline-container-orgc3aae19" class="outline-3">
<h3 id="orgc3aae19"><span class="section-number-3">2.1.</span> Household Demand</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Households demand funds for houses (mortgages), auto loans, and general spending (revolving loans). Generally thier demand for loanable funds increases over time with inflation and increasing wages.
</p>
</div>
</div>

<div id="outline-container-org5eab63b" class="outline-3">
<h3 id="org5eab63b"><span class="section-number-3">2.2.</span> Business Demand</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Businesses use decision rules such as Net Present Value and Internal Rate of Return to decide whether to make a capital investment. These rules are more likely to accept a project if the interest rate is lower, and therefore businesses demand more funds at lower interest rates.
</p>

<p>
Taxes may also have a large effect on business demand for loanable funds.  If corporate taxes decline then cash flows increase and business demand for funds will shift right.  <i>Shift right</i> means more funds are demanded at every interest rate.
</p>
</div>
</div>

<div id="outline-container-org0cf4798" class="outline-3">
<h3 id="org0cf4798"><span class="section-number-3">2.3.</span> Government Demand</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Government demand for loanable funds is unique in that it generally doesn't depend on the interest rate. Governments demand the same amount of funds regardless of the interest rate.  We can represent this with a vertical demand curve. 
</p>
</div>
</div>
</div>

<div id="outline-container-org7038ad8" class="outline-2">
<h2 id="org7038ad8"><span class="section-number-2">3.</span> Macroeconomic Factors that Shift the Equilibrium Interest Rate</h2>
<div class="outline-text-2" id="text-3">
<p>
In this section we will take a look at how the supply and demand for loanable funds will react to changes in macroeconomic variables. This will tell us the effect on the equilibrium interest rate.
</p>
</div>

<div id="outline-container-orgcbae25f" class="outline-3">
<h3 id="orgcbae25f"><span class="section-number-3">3.1.</span> Economic Growth</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orge80796a" class="outline-4">
<h4 id="orge80796a"><span class="section-number-4">3.1.1.</span> An Increase in Economic Growth</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
An increase in economic growth will increase the demand for loanable funds&#x2014;funds are needed for capital expansion.  The supply of loanable funds will generally remain unchanged.  This means interest rates will increase with increasing economic growth.
</p>

<div id="curve_chart"></div>
</div>
</div>

<div id="outline-container-org4b41ff5" class="outline-4">
<h4 id="org4b41ff5"><span class="section-number-4">3.1.2.</span> An Decrease in Economic Growth</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Conversely, a decrease in economic growth will decrease the demand for loanable funds and leave the supply unchanged, thereby lowering interest rates.
</p>

<blockquote>
<p>
<b><b>Passive Monetary Policy</b></b>: Note the Federal Reserve lowers interest rates when economic growth slows and raises interest rates when economic growth increases such that it causes inflation. But from what we just learned, we don't need the Fed to do this&#x2014;interest rates will adjust by themselves.  The Fed will counter that they will increase and decrease interest rates <i>before</i> the economic slowdown (or inflation) thereby keeping economic growth constant.  However a problem with this assertion (besides the Fed's track record) is you would need to be able to forecast economic growth which is a very difficult task.  
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgc819e78" class="outline-3">
<h3 id="orgc819e78"><span class="section-number-3">3.2.</span> Inflation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We may already be somewhat familiar with the relationship between inflation and nominal interest rates from the Fisher Effect:
</p>

<p>
\[(1 + n) = (1 + r)(1 + i)\]
</p>

<p>
where:
</p>

<ul class="org-ul">
<li>n: the nominal interest rate</li>
<li>r: the real interest rate</li>
<li>i: expected inflation</li>
</ul>

<blockquote>
<ul class="org-ul">
<li>Nominal Interest Rate:  the change in the amount of dollars you will have.</li>
<li>Real Interest Rate:  the change in the amount of stuff you will be able to buy</li>
</ul>
<p>
Note: we care about the real rate.
</p>
</blockquote>

<p>
From this equation we can see that as inflation increases, the nominal interest rate increases.  Nominal interest rates and inflation are positively related.
</p>
</div>

<div id="outline-container-org2bc0544" class="outline-4">
<h4 id="org2bc0544"><span class="section-number-4">3.2.1.</span> Increase in Inflation</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Supply decreases and demand increases causing an increase in the equilibrium interest rate.
</p>

<div id="curve_chart2"></div>

<p>
See the video below for an explanation of the change in the equilibrium interest rate.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/JAe5dE619dA?si=XQb0Mb2TnVncpex8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>

<p>
A decrease in inflation expectations will have the opposite effects on supply and demand, and thereby lower the equilibrium interest rate.
</p>
</div>
</div>

<div id="outline-container-org12281a4" class="outline-4">
<h4 id="org12281a4"><span class="section-number-4">3.2.2.</span> Increase in US Debt</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The US government generally runs budget deficits and has a massive amount of outstanding debt.   This means as the government demands more funds, the demand curve shifts right, while the supply curve is unchanged.  This means the interest rate increases.
</p>

<p>
Remember the shape of the curve of the government demand for loanable funds&#x2014;it is vertical meaning the government demands funds regardless of the interest rate. This means the government may demand so much funds that it increases interest rates beyond what businesses can pay.  This is called <i>crowding out</i>.
</p>

<blockquote>
<p>
<b><b>A History of Crowding Out</b></b>:  Politicians like to spend, and so they have a history of downplaying the effect of government borrowing on interest rates.  For example, a recent Vice President was famous for stating "Deficits don't matter".
</p>
</blockquote>

<p>
From approximately 2000 to 2021 the US ran increasingly large deficits (as you can see in the charts below), however interest rates generally fell.  This is because while the US increased it debt, the Fed also increased the money supply (chart below).   The Fed essentially financed much of the US deficits with new money.  Foreigners also financed part of the deficits.  This works so long as inflation remains low, however inflation markedly increased around 2022, so the Fed may no longer be able to finance deficit spending.
</p>




<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1cSNC&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>


<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1dsBt&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>

<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1aBRl&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>

<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1ep1G&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>


<iframe src="https://fred.stlouisfed.org/graph/graph-landing.php?g=1epHK&width=670&height=475" scrolling="no" frameborder="0" style="overflow:hidden; width:670px; height:525px;" allowTransparency="true" loading="lazy"></iframe>
</div>
</div>
