index.org
*** Foreign Flows

Foreign investors may supply funds to US markets which will increase the supply curve and lower interest rates.  Of course, they can also demand funds in the US which will increase US interest rates.

Generally, however, foreigners have supplied funds to US markets as a result of the US trade deficit. We in the US buy more goods from abroad then we sell.  This means we send more US dollars abroad then foreign currency is sent to the US.  This would mean the US dollar would decline. So this doesn't happen (foreigners want the US dollar to be high---can you think of why?) they supply funds to US markets. In short, if you buy a $100 phone from abroad, foreigners then invest $100 in US markets (see the Balance of Payments for more).  So foreign flows have generally /lowered/ US interest rates.

* Conclusion

Changes in interest rates are the aggregation of all these factors. So if interest rates rise by a percent over the next month, we know in aggregate demand for funds increased more than supply, however the exact contribution of the budget deficit, or economic growth, etc is unclear.  We use statistical models to parse the various factors.

**A practical note on interest rate forecasting**

Forecasting interest rates is exceedingly difficult , and if you could do it you would be a billionaire trading your own account.  So most corporations who use interest rate forecasts just buy these forecasts from reputable investment banks.  In this way they don't waste money trying to do it themselves, and if they are wrong they can say they bought the forecast from the most knowledgeable people around (this is termed /CYA/ and as a practical matter drives many decisions). 


